{"Q": "GitHubリポジトリ提出がリアルタイム参加不可の場合どうすればよいですか？", "A": "次週講義で手順を案内し、フォーム提出に対応します。"}
{"Q": "前提知識の資料が受講の手引きで見つけられません。どこを確認すればよいでしょうか？", "A": "01_講義資料→Day0_エンジニアリング基礎_参考リンク集 <URL> にあります。"}
{"Q": "宿題提出フォームは複数回提出できますか？第1回だけ先に提出し、後から第2回を追記して再提出したいです。", "A": "フォームは回答後も「回答を編集」ボタンから修正可能です。まず第1回を提出し、後日第2回を追記して再提出していただけます。"}
{"Q": "米国留学中で期末試験のため 4/30 までの宿題提出が困難です。それ以降の提出は認められますか？", "A": "大変恐縮ですが、宿題提出期限以降のご提出は受付致しかねます。多数の方にご受講いただいているため、個別事情へのご対応ができかねますこと、ご理解いただけますと幸いです。"}
{"Q": "演習2を手順通り完了後 AWS をログアウトし、再ログインしたところモデル設定が元に戻っていました。運営による取組状況確認に支障はありませんか？変更を保持する方法があれば教えてください。実行コマンド: mkdir /tmp/testdir … npm install など。", "A": "取組状況の確認に支障はありません。宿題3完了後のアプリケーション公開 URL を提出いただければ問題ありません。CloudShell はセッション切断で /home 以外のデータが消えるため、fork した自身の GitHub リポジトリを利用するなどで変更を保持してください。"}
{"Q": "第1回宿題で GitHub リポジトリを fork するとデフォルトが master ブランチになります。main ではなく master のままで問題ありませんか？", "A": "master のままで大丈夫です。宿題資料も『デフォルトブランチ（main または master）にコミットされていること』と修正しました。別ブランチで開発すると評価できませんのでご注意ください。"}
{"Q": "Fork するとデフォルトが master ブランチになりますが、宿題では main ではなく master のままで問題ありませんか？", "A": "master のままで大丈夫です。資料も『デフォルトブランチ（main または master）にコミットされていること』と修正しました。別ブランチで開発すると評価できませんのでご注意ください。(Fork 時は第1回が master、第2回が main になります)。混乱させてしまい申し訳ありません。"}
{"Q": "課題提出フォームの氏名欄は OmniCampus のアカウントネームを記載すれば良いですか？", "A": "氏名欄には OmniCampus に登録されている氏名を記載してください（アカウントネームではありません）。"}
{"Q": "Day1 宿題で fork を勘違いし、自分のリポジトリにコミットしてしまいました。提出はそのリポジトリでも良いでしょうか？それとも正規リポジトリを fork し直して提出すべきでしょうか？", "A": "採点の都合上、正規リポジトリを fork し直し、そちらでコミットした状態を提出してください。"}
{"Q": "第2回宿題をローカル環境でデプロイしようとしていますが、`aws configure sso` で求められる SSO start URL などが分からず詰まっています。IAM Identity Center を有効化しようとしましたが権限がなくできません。どの URL を使えばよいでしょうか？", "A": "演習で案内した AWS Access Portal の URL がそのまま Identity Center の SSO start URL となります。アクセスポータル URL を `aws configure sso` に入力してください。"}
{"Q": "過去に閉鎖した Gmail アドレスでは AWS アカウントを再作成できないため、別メールアドレスで新規 AWS アカウントを作成しました。このアカウントで演習・課題提出を進めても支障はありませんか？運営側でメールアドレス更新が必要な場合は手続きを教えてください。", "A": "今回はこちらで用意した AWS 環境にアクセスポータルからログインいただければ問題なく利用できます。まずは案内済み手順（<URL>）に従ってログインしてください。追加の手続きは不要です。"}
{"Q": "講座登録 Gmail で AWS アカウント作成を試みましたがエラーで進めません。過去に同アドレスで個人用 AWS アカウントを開設していたことが影響していますか？大学のメールアドレスならログインできましたが、このアカウントで課題を進めても問題ないでしょうか？", "A": "AWS アカウント開設状況は今回の演習環境に影響しません。まずは案内済み手順 (<URL>) を再確認し、それでも解決しない場合はメールアドレスと画面キャプチャを添えて freshdesk (<URL>) へお問い合わせください。大学のメールアドレスでログインできた場合はそのアカウントで課題を進めて構いません。課題完了後に新旧メールアドレス情報を freshdesk へご連絡いただければ助かります。"}
{"Q": "PC から AWS ログインを試みるとリクエスト完了エラーが出ますが、スマホではログインできます。PC 側でメールアドレスを誤入力して複数回パスワードを試したことが原因でしょうか？調査していただけますか？", "A": "スマホでログインできているため設定側の問題は考えにくく、一時的なアクセス障害の可能性があります。PC で再試行し、解決しない場合はブラウザのキャッシュ削除やシークレットウィンドウをお試しください。なお、メールアドレスと画面キャプチャを添えて freshdesk (<URL>) にご連絡いただければ詳細確認いたします。"}
{"Q": "誤って宿題を 1 度提出した後、訂正版を再提出して 2 回提出した状態になっています。連絡や追加手続きは必要でしょうか？誤り内容は自分のリポジトリで提出していたのをフォーク先リポジトリで提出し直したものです。", "A": "フォームの回答を確認しましたが特に問題ありません。追加の手続きや連絡は不要ですのでご安心ください。"}
{"Q": "宿題 3 番目の課題が理解できません。後日あらためて解説していただける機会は設けてもらえますか？", "A": "ご意見ありがとうございます。第1回／第2回宿題の提出期限は延長しましたが、解説会の予定はありません。まずは講義ノート・Wiki、および Slack チャンネル #93_aie2025s_受講生間の疑問解決_講義-宿題 をご活用ください。"}
{"Q": "第2回宿題の GitHub 公開リポジトリ URL を Google フォームで回答する際、`https://github.com/[your github id]/simplechat/tree/main` と `/tree/main` 付きで送信してしまいました。この URL でも問題ありませんか？", "A": "ご連絡ありがとうございます。こちらで修正しますので問題ありません。"}
{"Q": "AWS で独自モデルをデプロイしようとしましたが、各フェーズのログに時間がかかり Bedrock 画面にも入れず、コマンドシェルも使用できません。第2回宿題の Google フォーム提出期限を延長いただくことは可能でしょうか？", "A": "第1回／第2回宿題の提出期限を 1 週間延長しました。詳細は全体連絡チャンネルの案内 (<URL>) をご確認ください。"}
{"Q": "Hugging Face で meta-llama/Meta-Llama-3-8B-Instruct を有効化しようとすると Reject になります。ai_engineering_03_T4.ipynb のモデル変更以外に対策はありますか？", "A": "該当モデル名で Hugging Face 内を検索し、モデルページから利用申請を行ってください。承認されれば使用可能になります。"}
{"Q": "第3回の任意課題は本日 17 時締切と理解していますが、GW 中のネットワーク不調で着手が遅れました。提出期限を延長していただくことは可能でしょうか？", "A": "提出期間を 1 週間延長しました。詳細は全体連絡チャンネルの案内 (<URL>) をご確認ください。"}
{"Q": "第3回宿題の採点がエラーで失敗しています。提出 csv が悪いのでしょうか？（1回目と2回目は同じ方法で提出して問題ありませんでした）", "A": "運営側の不手際で採点スクリプトに不具合がありました。再度採点を行い修正済みですので、あらためてスコアをご確認ください。"}
{"Q": "Day4 の宿題 csv を昨日 17 時に提出しましたが採点されていません。締切後でも採点されないことはありますか？", "A": "確認テスト課題は提出締切後に一括採点しています。現在 Day4 宿題は採点待ちですのでご安心ください。CSV が表示されていれば正常に提出できています。"}
{"Q": "第1回宿題で本日 17 時を過ぎてから少し変更を加えてしまいました。提出物として問題ありますか？", "A": "ご連絡ありがとうございます。問題ありません。"}
{"Q": "多忙のため課題に取り組む時間が確保できず提出できていません。過去の課題について期限延長や別の救済措置を講じていただくことは可能でしょうか？", "A": "現在は第3回の任意課題のみ期間を延長しています。過去課題の期限延長については個別対応いたしかねます。多数の方にご受講いただいているため、ご理解いただけますと幸いです。"}
{"Q": "最終課題でも演習で利用している AWS 環境を使えますか？また AWS 環境はいつまで利用可能でしょうか？", "A": "演習で利用したコンポーネントのみ 5/21 まで利用可能です。最終課題での利用については現在検討中です。"}
{"Q": "Day4 の宿題で昨日 17 時に CSV を提出しましたが採点されていません。採点されないこともありますか？（Day1〜3 は同方法で正常でした）。待っていれば採点されるのであれば問題ありません。", "A": "確認テスト課題は提出締切後に一括で採点しています。現在 Day4 は採点待ちの状態ですのでご安心ください。CSV が表示されていれば正常に提出できています。"}
{"Q": "参加希望調査の提出が遅れました。最終課題の提出は認められなくなりますか？", "A": "参加希望調査を提出していただければ最終課題の提出は可能です。"}
{"Q": "第5回課題で追加機能を実装できませんでした。提出に誤りがあると修了判定は厳しくなりますか？最終課題で挽回できますか？", "A": "第5回の提出期限を延長しましたのでご活用ください。修了判定の詳細はお答えできませんが、1 回の未提出で即未修了にはなりません。最終課題を頑張ってください。"}
{"Q": "修了証の英語版を用意していただくことは可能ですか？", "A": "申し訳ございません。現時点で英語版の修了証の準備はございません。"}
{"Q": "第5回課題の提出期限が 5/21 から 5/28 に延長されましたが、延長期間中の提出は遅延扱いとなり修了判定に影響しますか？", "A": "修了判定の詳細はお答えできませんが、1 回の未提出や提出遅延で即未修了とはなりません。"}
{"Q": "1〜3回の理解度確認テストは Colab 上で回答を実行すれば提出扱いとなり、CSV の提出は不要という認識で合っていますか？", "A": "確認テストは全回分とも Omnicampus への提出が必要です。"}
{"Q": "最終課題に関して、すべてのプロジェクトの質問への回答が出そろってから取り組む課題を決めたいと考えています。質問への回答予定を共有していただけますか？", "A": "プロジェクト質問への回答一覧は <URL> にまとめています。追加の質問は同フォーム経由で受け付け、随時回答を更新します。最終課題に必要なデータ（例：PJT08 の講義アンケートなど）の公開も準備中ですので、もうしばらくお待ちください。"}
{"Q": "PJT によっては最終課題用データが提供されないのでしょうか？公開済みの PJT07 と PJT09 の動画では『データは自分で用意』と説明されていました。", "A": "はい、データ提供の有無は PJT ごとに異なります。現在動画を公開している PJT07・PJT09 はデータ提供を予定していません。"}
{"Q": "Lambda で DB 登録処理を実装し動作しました。何が使えて何が使えないか判断方法が分からないので共有します。", "A": ""}